{
  "People": {
    "Architecture": {
      "0": "As an Enterprise Architect, I want to schedule additional deep dive workshops to fully develop and understand project scope and requirements.",
      "1": "As a Enterprise Architect, I want a Red Hat Architect to assist with the definition of a labelling policy, so that my applications are HA and ITDR complient.",
    },
    "Environment": {
      "0": "As an Infrastructure Engineer I want to be able to patch my Openshift infrastructure to the latest security patches",
      "1": "As an Infrastructure Engineer I want to install the N-1 release of Openshift Infrastructure so that I am one release behind the current release. ",
      "2": "As an Infrastructure Engineer I want to be abel to install Cloudforms in a resilient way for OCP Monitoring and Stats management",
    },
    "Methodology": {
      "0": "As a project stakeholder, I want IT team members to be available, so that the pilot sprints can be executed.",
    },
    "Strategy": {
      "0": "As an Enterprise Architect I want to be part of an OSE Pilot steering committee, so that standards can be defined.",
      "1": "As an Enterprise Architect I want a Red Hat presence during steering committee meetings, so that Best practice and knowledge can be shared.",
      "2": "As an Enterprise Architect I want a development presence during steering committee meetings, so that they are able to assist in the design and architecture of the project.",
      "3": "As an Enterprise Architect I want to ensure that the Developers using the Openshift platform understand best practice guidelines with containers.",
    }
  },
  "Process": {
    "Architecture": {
      "0": "As an Enterprise Architect I want an extensible OpenShift Architecture so that the pilot is HA / ITDR compliant",
      "1": "As an Enterprise Architect I want to capture a standard method for repeatable installations of OSE, so that global IT Teams can share the standard method.",
      "2": "As an Enterprise Architect I would like to ensure that all pre-requisites are met prior to installing the OSE infrastructure, so that the pilot environment can function.",
    },
    "Automation": {
      "0": "As a Developer I want to be able to integrate my corporate Jenkins with OSE, so that my existing automation and orchestration is available.",
    },
    "Environment": {
      "0": "As a Developer I want to be able to contribute and consume knowledge from Communities of Interest and Communities of Practice, so that I can understand the current knowledge trends and solve problems ",
    },
    "Strategy": {
      "0": "As an Enterprise Architect I would like a method of patching my RHEL systems, so that standard, up2date builds can be shared globally.",
      "1": "As a developer, I want to create Java, .Net, Ruby, Python, Scala applications within the OSE environment to enable rapid deployment.",
      "2": "As an Enterprise Architect I would like to be able to create custom containers using Docker images sourced from Red Hat registry / Satellite, so that my images are verified and secure.",
    }
  }
}
